name: "whisper_medium_fp16_decoder_with_past"

platform: "onnxruntime_onnx"

max_batch_size: 0

input {
  name: "input_ids"
  data_type: TYPE_INT64
  dims: [ -1, -1 ]
}

input {
  name: "past_key_values.0.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.0.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.0.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.0.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.1.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.1.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.1.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.1.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.2.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.2.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.2.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.2.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.3.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.3.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.3.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.3.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.4.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.4.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.4.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.4.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.5.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.5.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.5.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.5.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.6.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.6.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.6.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.6.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.7.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.7.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.7.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.7.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.8.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.8.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.8.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.8.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.9.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.9.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.9.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.9.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.10.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.10.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.10.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.10.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.11.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.11.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.11.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.11.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.12.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.12.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.12.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.12.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.13.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.13.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.13.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.13.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.14.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.14.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.14.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.14.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.15.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.15.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.15.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.15.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.16.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.16.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.16.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.16.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.17.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.17.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.17.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.17.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.18.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.18.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.18.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.18.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.19.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.19.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.19.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.19.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.20.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.20.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.20.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.20.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.21.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.21.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.21.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.21.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.22.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.22.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.22.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.22.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.23.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.23.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.23.encoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

input {
  name: "past_key_values.23.encoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "logits"
  data_type: TYPE_FP32
  dims: [ -1, 1, 51865 ]
}

output {
  name: "present.0.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.0.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.1.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.1.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.2.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.2.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.3.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.3.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.4.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.4.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.5.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.5.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.6.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.6.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.7.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.7.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.8.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.8.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.9.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.9.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.10.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.10.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.11.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.11.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.12.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.12.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.13.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.13.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.14.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.14.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.15.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.15.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.16.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.16.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.17.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.17.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.18.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.18.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.19.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.19.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.20.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.20.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.21.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.21.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.22.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.22.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.23.decoder.key"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

output {
  name: "present.23.decoder.value"
  data_type: TYPE_FP32
  dims: [ -1, 16, -1, 64 ]
}

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]

parameters {
  key: "default_model_filename"
  value: { string_value: "decoder_with_past_model.onnx" }
}
