# Цепочка: PCM 16 kHz mono → log-mel → ONNX encoder.
# Полный текст (авторегрессионный декодер) в ensemble нельзя описать в одном графе —
# его нужно вызывать отдельно (worкер Go: whisper_medium_fp16_decoder[_with_past]).

name: "whisper_ensemble"
platform: "ensemble"
max_batch_size: 0

input [
  {
    name: "AUDIO_PCM"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]

output [
  {
    name: "encoder_hidden_states"
    data_type: TYPE_FP32
    dims: [ -1, 1500, 1024 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess_python"
      model_version: -1
      input_map {
        key: "AUDIO_PCM"
        value: "AUDIO_PCM"
      }
      output_map {
        key: "MEL_FEATURES"
        value: "mel_features"
      }
    },
    {
      model_name: "whisper_medium_fp16_encoder"
      model_version: -1
      input_map {
        key: "input_features"
        value: "mel_features"
      }
      output_map {
        key: "last_hidden_state"
        value: "encoder_hidden_states"
      }
    }
  ]
}
